<a href="https://colab.research.google.com/github/Ayanlola2002/Stutern/blob/master/stuttern_presentation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [4]:
#SETTING UP MY DATAFRAME
# intialise data of lists. 
data = {'Cust_Id':[1001,1002,1003,1004,1005,1007],'Name':['Tom', 'nick', 'krish', 'jack','tommy','kunle'], 'Age':[20, 21, 19, 18,np.nan,np.nan],'State':['Lagos','Oyo','Kaduna','Imo','abia','Borno'],'Sex':['Male','female','m','female','male',np.nan]}       
# Create DataFrame 
CUSTOMER=pd.DataFrame(data) 
  
# Print the output. 
CUSTOMER

   Cust_Id   Name   Age   State     Sex
0     1001    Tom  20.0   Lagos    Male
1     1002   nick  21.0     Oyo  female
2     1003  krish  19.0  Kaduna       m
3     1004   jack  18.0     Imo  female
4     1005  tommy   NaN    abia    male
5     1007  kunle   NaN   Borno     NaN

In [0]:
CUSTOMER_COPY=CUSTOMER.copy()
Customer_orders_COPY=Customer_orders.COPY()

In [7]:
Customer_orders=pd.DataFrame(
    {'ORDER_ID':[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15],
     'ORDER_QTY':[2,4,5,6,4,3,4,5,3,5,6,3,7,4,3],
      'CUST_ID':[1004,1005,1001,1004,1005,1002,1001,1003,1004,1006,1002,1007,1007,1003,1001],
      'ORDER_DATE':['01/01/2020','02/01/2020','03/01/2020','04/01/2020','05/01/2020','06/02/2020','07/02/2020','08/02/2020','09/02/2020','10/03/2020','11/03/2020','12/03/2020','13/03/2020','14/03/2020','15/03/2020'],
     'UNIT_PRICE' :[3,4,5,6,4,7,8,9,5,6,8,9,5,8,5]
    }
)
Customer_orders

    ORDER_ID  ORDER_QTY  CUST_ID  ORDER_DATE  UNIT_PRICE
0          1          2     1004  01/01/2020           3
1          2          4     1005  02/01/2020           4
2          3          5     1001  03/01/2020           5
3          4          6     1004  04/01/2020           6
4          5          4     1005  05/01/2020           4
5          6          3     1002  06/02/2020           7
6          7          4     1001  07/02/2020           8
7          8          5     1003  08/02/2020           9
8          9          3     1004  09/02/2020           5
9         10          5     1006  10/03/2020           6
10        11          6     1002  11/03/2020           8
11        12          3     1007  12/03/2020           9
12        13          7     1007  13/03/2020           5
13        14          4     1003  14/03/2020           8
14        15          3     1001  15/03/2020           5

In [9]:
CUSTOMER.shape

(6, 5)

In [10]:
#head() and tail()
CUSTOMER.head()
#gives the first five index

   Cust_Id   Name   Age   State     Sex
0     1001    Tom  20.0   Lagos    Male
1     1002   nick  21.0     Oyo  female
2     1003  krish  19.0  Kaduna       m
3     1004   jack  18.0     Imo  female
4     1005  tommy   NaN    abia    male

In [14]:
#dtypes()
CUSTOMER.dtypes
#gives a series of datypes in the dataframe

Cust_Id      int64
Name        object
Age        float64
State       object
Sex         object
dtype: object

In [38]:
#info()
CUSTOMER.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
Cust_Id    6 non-null int64
Name       6 non-null object
Age        4 non-null float64
State      6 non-null object
Sex        5 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 368.0+ bytes

In [0]:
print(type(CUSTOMER.dtypes))

In [22]:
#select_types()
#checking which columns are object type i.e string
CUSTOMER.select_dtypes(include=['object']).columns

Index(['Name', 'State', 'Sex'], dtype='object')

In [26]:
#astype()
Customer_orders['UNIT_PRICE'].dtype
#unit type is int
#we want to convert to float
Customer_orders['UNIT_PRICE'].astype(float)

0     3.0
1     4.0
2     5.0
3     6.0
4     4.0
5     7.0
6     8.0
7     9.0
8     5.0
9     6.0
10    8.0
11    9.0
12    5.0
13    8.0
14    5.0
Name: UNIT_PRICE, dtype: float64

In [39]:
#unique() and nunique()
print(CUSTOMER['Sex'].unique())
#nunique will not count nan values except you add as a parameter dropna =False
print(CUSTOMER['Sex'].nunique(dropna=False))

['Male' 'female' 'm' 'male' nan]
5

In [37]:
#value_counts()
CUSTOMER['Sex'].value_counts()

female    2
m         1
Male      1
male      1
Name: Sex, dtype: int64

In [40]:
#dropna() & drop
CUSTOMER.dropna(axis=0)

   Cust_Id   Name   Age   State     Sex
0     1001    Tom  20.0   Lagos    Male
1     1002   nick  21.0     Oyo  female
2     1003  krish  19.0  Kaduna       m
3     1004   jack  18.0     Imo  female

In [47]:
#drop specified columns
CUSTOMER.drop(['Name','Age'],axis=1)

   Cust_Id   State     Sex
0     1001   Lagos    Male
1     1002     Oyo  female
2     1003  Kaduna       m
3     1004     Imo  female
4     1005    abia    male
5     1007   Borno     NaN

In [0]:
#fillNa() filling customer column with unspecified
CUSTOMER['Sex'].fillna('unspecified',inplace=True)

In [0]:
#replace
CUSTOMER['Sex'].replce({'NaN':'UNSPECIFIED'},inplace=True)

In [51]:
Customer_orders

    ORDER_ID  ORDER_QTY  CUST_ID  ORDER_DATE  UNIT_PRICE
0          1          2     1004  01/01/2020           3
1          2          4     1005  02/01/2020           4
2          3          5     1001  03/01/2020           5
3          4          6     1004  04/01/2020           6
4          5          4     1005  05/01/2020           4
5          6          3     1002  06/02/2020           7
6          7          4     1001  07/02/2020           8
7          8          5     1003  08/02/2020           9
8          9          3     1004  09/02/2020           5
9         10          5     1006  10/03/2020           6
10        11          6     1002  11/03/2020           8
11        12          3     1007  12/03/2020           9
12        13          7     1007  13/03/2020           5
13        14          4     1003  14/03/2020           8
14        15          3     1001  15/03/2020           5

In [59]:
#groupby
Customer_orders.groupby('CUST_ID')['ORDER_QTY','UNIT_PRICE'].sum()

         ORDER_QTY  UNIT_PRICE
CUST_ID
1001            12          18
1002             9          15
1003             9          17
1004            11          14
1005             8           8
1006             5           6
1007            10          14

In [56]:
#view the groupings
list(Customer_orders.groupby(['CUST_ID']))

[(1001,     ORDER_ID  ORDER_QTY  CUST_ID  ORDER_DATE  UNIT_PRICE
  2          3          5     1001  03/01/2020           5
  6          7          4     1001  07/02/2020           8
  14        15          3     1001  15/03/2020           5),
 (1002,     ORDER_ID  ORDER_QTY  CUST_ID  ORDER_DATE  UNIT_PRICE
  5          6          3     1002  06/02/2020           7
  10        11          6     1002  11/03/2020           8),
 (1003,     ORDER_ID  ORDER_QTY  CUST_ID  ORDER_DATE  UNIT_PRICE
  7          8          5     1003  08/02/2020           9
  13        14          4     1003  14/03/2020           8),
 (1004,    ORDER_ID  ORDER_QTY  CUST_ID  ORDER_DATE  UNIT_PRICE
  0         1          2     1004  01/01/2020           3
  3         4          6     1004  04/01/2020           6
  8         9          3     1004  09/02/2020           5),
 (1005,    ORDER_ID  ORDER_QTY  CUST_ID  ORDER_DATE  UNIT_PRICE
  1         2          4     1005  02/01/2020           4
  4         5          4     1005  05/01/2020           4),
 (1006,    ORDER_ID  ORDER_QTY  CUST_ID  ORDER_DATE  UNIT_PRICE
  9        10          5     1006  10/03/2020           6),
 (1007,     ORDER_ID  ORDER_QTY  CUST_ID  ORDER_DATE  UNIT_PRICE
  11        12          3     1007  12/03/2020           9
  12        13          7     1007  13/03/2020           5)]

In [54]:
Customer_orders_df.first()

         ORDER_ID  ORDER_QTY  ORDER_DATE  UNIT_PRICE
CUST_ID
1001            3          5  03/01/2020           5
1002            6          3  06/02/2020           7
1003            8          5  08/02/2020           9
1004            1          2  01/01/2020           3
1005            2          4  02/01/2020           4
1006           10          5  10/03/2020           6
1007           12          3  12/03/2020           9

In [0]:
#to_date()

In [0]:
#set_index()

In [0]:
#loc & iloc

In [60]:
#query()
CUSTOMER_Filtered1=CUSTOMER.query('Age < 30')
CUSTOMER_Filtered=CUSTOMER.query('Age < 30')
print(CUSTOMER_Filtered)

   Cust_Id   Name   Age   State     Sex
0     1001    Tom  20.0   Lagos    Male
1     1002   nick  21.0     Oyo  female
2     1003  krish  19.0  Kaduna       m
3     1004   jack  18.0     Imo  female

In [0]:
#apply()

In [0]:
#lambda

In [0]:
#user define function